Dlubal.RFEM5.PlasticHinge
Plastic hinge parameters

Dlubal.RFEM5.PlasticHinge.Type
Plastic hinge type

Dlubal.RFEM5.PlasticHinge.Antimetric
Antimetric type

Dlubal.RFEM5.PlasticHinge.UserDefinedType
User-defined type (read only)

Dlubal.RFEM5.PlasticHinge.AutomaticType
Automatic type (read only)

Dlubal.RFEM5.PlasticHinge.DiagramParameters
Two-dimensional array of diagram parameters

Dlubal.RFEM5.PlasticHinge.NegativeYieldForceOrMoment
Negative yield force or moment

Dlubal.RFEM5.PlasticHinge.PositiveYieldForceOrMoment
Positive yield force or moment

Dlubal.RFEM5.PlasticHinge.NegativeYieldDeformationOrRotation
Negative yield deformation or rotation

Dlubal.RFEM5.PlasticHinge.PositiveYieldDeformationOrRotation
Positive yield deformation or rotation

Dlubal.RFEM5.PlasticHinge.AcceptanceCriteriaType
Type of acceptance criteria

Dlubal.RFEM5.PlasticHinge.NegativeImmediateOccupancy
Negative immediate occupancy

Dlubal.RFEM5.PlasticHinge.PositiveImmediateOccupancy
Positive immediate occupancy

Dlubal.RFEM5.PlasticHinge.NegativeLifeSafety
Negative life safety

Dlubal.RFEM5.PlasticHinge.PositiveLifeSafety
Positive life safety

Dlubal.RFEM5.PlasticHinge.NegativeCollapsePrevention
Negative collapse prevention

Dlubal.RFEM5.PlasticHinge.PositiveCollapsePrevention
Positive collapse prevention